Stable/Base_Cases_Stable/Base_Case_Stable/CFD/constant/dataHeadCFD
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dataHeadCFD;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Mesh variables
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//radial_comp 15;
//circum_comp 10;
//z_comp 17;
//z2_comp 4;



// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// ControlDict variables
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
startTimee 0;
endTimee 0.05;
//timeStepCFD 1e-06;
writeIntervall 0.0025;

//outputTimeSE 2.0;

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// CouplingProperties
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//couplingIntervall 10;

smoothingLengthL 0.0011;

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Rotor variables
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
rotorSpeed 2500;
torqueFreq 0.0025;
//orbitalDiameter 5;

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// transportProperties
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

viscosityFl 1.0034e-6;
//sigmaF1 57.05;
//thetaF1 32.79;
densityFl 998.2;

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// SnappyHexMeshDict
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//meshRefinement 1;

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// decomposeParDict
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//numberOfProcessors 16;
