Stable/Base_Cases_Stable/Base_Case_Stable/CFD/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "dataHeadCFD"

transportModel  Newtonian;

nu              nu  [ 0 2 -1 0 0 0 0 ] $viscosityFl;//0.01; //0.1516;//0.111426;//1.875e-03;//7.5e-03;//0.265883;
rho             rho [1 -3 0 0 0 0 0] $densityFl;


// ************************************************************************* //
