Stable/Base_Cases_Stable/Base_Case_Stable/CFD/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        /*solver          PCG;
        preconditioner  DIC;
        tolerance       1e-12;
        relTol          0.1;*/
        solver           GAMG;
        tolerance        1e-12;
        relTol           0.01;

        smoother         DICGaussSeidel;
    }

    pFinal
    {
        /*solver          PCG;
        preconditioner  DIC;
        tolerance       1e-12;
        relTol          0;*/
        $p;
        relTol          0;
        
    }

    "(U|k|epsilon|R|nuTilda)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-05;
        relTol          0;
    }

    "(voidfraction|Ksl|UsNext|voidfractionNext|sSmoothField|vSmoothField|fSmooth)"
    {
        /*solver          PCG;
        preconditioner  DIC;
        tolerance       1e-09;
        relTol          1e-06;*/
        solver           GAMG;
        tolerance        1e-12;
        relTol           0.01;

        smoother         DICGaussSeidel;
        
    }
}

PISO
{
    nCorrectors     5;
    nNonOrthogonalCorrectors 1;
    pRefCell        0;
    pRefValue       0;
}


// ************************************************************************* //
